#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ssm_parameter.ssh_key: Reading...
data.aws_ami.ubuntu: Reading...
aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/flow-logs]
aws_iam_role.ssm_role: Refreshing state... [id=rs-bastion-ssm-role-dev]
aws_kms_key.cloudwatch: Refreshing state... [id=1b5cb976-4b02-4dff-92b3-8173fe8fa691]
aws_iam_policy.ssm_cert_read_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-cert-read-policy-dev]
aws_iam_role.vpc_flow_logs_role: Refreshing state... [id=rs-vpc-flow-logs-role-dev]
aws_eip.nat: Refreshing state... [id=eipalloc-0ca6f2b3bae992fb3]
aws_vpc.main: Refreshing state... [id=vpc-0c7ed8f67d0155a4b]
aws_iam_instance_profile.ssm_profile: Refreshing state... [id=rs-bastion-instance-profile-dev]
aws_iam_role_policy_attachment.ssm_attach: Refreshing state... [id=rs-bastion-ssm-role-dev-20250625234539176300000002]
aws_iam_role_policy_attachment.vpc_flow_logs_policy: Refreshing state... [id=rs-vpc-flow-logs-role-dev-20250625234539117300000001]
data.aws_ssm_parameter.ssh_key: Read complete after 1s [id=/development/KEYPAIR]
local_file.ssh_key: Refreshing state... [id=4edc0d98a397011e99505d24aad17357304656d0]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0d4d7e98021b6b9a6]
aws_flow_log.vpc_flow: Refreshing state... [id=fl-0c8ae145e266d6b17]
aws_subnet.private[1]: Refreshing state... [id=subnet-040f06f7b4fe71f22]
aws_subnet.private[0]: Refreshing state... [id=subnet-0498943ff7beb9c31]
aws_subnet.public[0]: Refreshing state... [id=subnet-0af42ee7da056f68a]
aws_security_group.vm_private_sg: Refreshing state... [id=sg-079dbc88f71c17641]
aws_subnet.public[1]: Refreshing state... [id=subnet-0d8d6b1fed8cca154]
aws_internet_gateway.igw: Refreshing state... [id=igw-09f8b33ca2a990c2a]
aws_security_group.bastion_sg: Refreshing state... [id=sg-072df0055ab58c138]
aws_security_group.vm_public_sg: Refreshing state... [id=sg-0cb488c986304620f]
aws_network_acl.private: Refreshing state... [id=acl-0ab9a70bb65beea92]
aws_instance.k3s_control_plane: Refreshing state... [id=i-004bc6c836bf6cd48]
aws_instance.k3s_worker: Refreshing state... [id=i-0ae8202bdb4aa1c7b]
aws_route_table.public: Refreshing state... [id=rtb-0a6be062e1f8344b6]
aws_nat_gateway.natgw: Refreshing state... [id=nat-054b9433cac89e691]
aws_network_acl.public: Refreshing state... [id=acl-0b6b75f567aaf7e9a]
aws_instance.bastion: Refreshing state... [id=i-028d71ac0b3442fb4]
aws_network_acl_rule.private_inbound_all_vpc: Refreshing state... [id=nacl-3593097250]
aws_network_acl_rule.private_inbound_icmp_vpc: Refreshing state... [id=nacl-3127084623]
aws_network_acl_rule.private_outbound_all: Refreshing state... [id=nacl-4238232095]
aws_network_acl_rule.private_inbound_ephemeral: Refreshing state... [id=nacl-1238734886]
aws_network_acl_rule.public_inbound_all: Refreshing state... [id=nacl-916360661]
aws_network_acl_rule.public_outbound_all: Refreshing state... [id=nacl-2645205781]
aws_route_table.private: Refreshing state... [id=rtb-03fcc62d95c0118a8]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04d220a662862500a]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c848ad50a8f32ec5]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06fac2bf6b809e697]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-088fd966236b7a860]
null_resource.provision_k3s_control_plane: Refreshing state... [id=7326862244600897326]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_instance_profile.controlplane_profile will be created
  + resource "aws_iam_instance_profile" "controlplane_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "rs-controlplane-instance-profile-dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "rs-controlplane-role-dev"
      + tags_all    = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-06-25"
          + "ManagedBy" = "Terraform"
          + "Task"      = "3. K8s Cluster Configuration and Creation"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.ssm_profile will be updated in-place
  ~ resource "aws_iam_instance_profile" "ssm_profile" {
        id          = "rs-bastion-instance-profile-dev"
        name        = "rs-bastion-instance-profile-dev"
      ~ role        = "rs-bastion-ssm-role-dev" -> "rs-bastion-role-dev"
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # aws_iam_instance_profile.worker_profile will be created
  + resource "aws_iam_instance_profile" "worker_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "rs-worker-instance-profile-dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "rs-worker-role-dev"
      + tags_all    = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-06-25"
          + "ManagedBy" = "Terraform"
          + "Task"      = "3. K8s Cluster Configuration and Creation"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.ssm_bastion_policy will be created
  + resource "aws_iam_policy" "ssm_bastion_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow Bastion EC2 instance to read SSH key from SSM"
      + id               = (known after apply)
      + name             = "rs-ssm-bastion-policy-dev"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:eu-north-1:767398122881:parameter/development/KEYPAIR"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-06-25"
          + "ManagedBy" = "Terraform"
          + "Task"      = "3. K8s Cluster Configuration and Creation"
        }
    }

  # aws_iam_policy.ssm_cert_read_policy will be destroyed
  # (because aws_iam_policy.ssm_cert_read_policy is not in configuration)
  - resource "aws_iam_policy" "ssm_cert_read_policy" {
      - arn              = "arn:aws:iam::767398122881:policy/rs-ssm-cert-read-policy-dev" -> null
      - attachment_count = 1 -> null
      - description      = "Allow EC2 to read cert.pem from SSM" -> null
      - id               = "arn:aws:iam::767398122881:policy/rs-ssm-cert-read-policy-dev" -> null
      - name             = "rs-ssm-cert-read-policy-dev" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ssm:GetParameter"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:eu-north-1:767398122881:parameter/development/KEYPAIR"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPA3FLD6CWARE5C664N4" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "CI"        = "GitHub Actions"
          - "Course"    = "RSSchool DevOps Course"
          - "Date"      = "2025-06-25"
          - "ManagedBy" = "Terraform"
          - "Task"      = "3. K8s Cluster Configuration and Creation"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_policy.ssm_controlplane_policy will be created
  + resource "aws_iam_policy" "ssm_controlplane_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow EC2 to read kubeconfig from SSM"
      + id               = (known after apply)
      + name             = "rs-ssm-controlplane-policy-dev"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:PutParameter"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:eu-north-1:767398122881:parameter/development/kubeconfig"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-06-25"
          + "ManagedBy" = "Terraform"
          + "Task"      = "3. K8s Cluster Configuration and Creation"
        }
    }

  # aws_iam_policy.ssm_worker_policy will be created
  + resource "aws_iam_policy" "ssm_worker_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow EC2 to read kubeconfig from SSM"
      + id               = (known after apply)
      + name             = "rs-ssm-worker-policy-dev"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:eu-north-1:767398122881:parameter/development/kubeconfig"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-06-25"
          + "ManagedBy" = "Terraform"
          + "Task"      = "3. K8s Cluster Configuration and Creation"
        }
    }

  # aws_iam_role.bastion_role will be created
  + resource "aws_iam_role" "bastion_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rs-bastion-role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-06-25"
          + "ManagedBy" = "Terraform"
          + "Task"      = "3. K8s Cluster Configuration and Creation"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.controlplane_role will be created
  + resource "aws_iam_role" "controlplane_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rs-controlplane-role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-06-25"
          + "ManagedBy" = "Terraform"
          + "Task"      = "3. K8s Cluster Configuration and Creation"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ssm_role will be destroyed
  # (because aws_iam_role.ssm_role is not in configuration)
  - resource "aws_iam_role" "ssm_role" {
      - arn                   = "arn:aws:iam::767398122881:role/rs-bastion-ssm-role-dev" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-06-25T23:45:38Z" -> null
      - force_detach_policies = false -> null
      - id                    = "rs-bastion-ssm-role-dev" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::767398122881:policy/rs-ssm-cert-read-policy-dev",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "rs-bastion-ssm-role-dev" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "CI"        = "GitHub Actions"
          - "Course"    = "RSSchool DevOps Course"
          - "Date"      = "2025-06-25"
          - "ManagedBy" = "Terraform"
          - "Task"      = "3. K8s Cluster Configuration and Creation"
        } -> null
      - unique_id             = "AROA3FLD6CWAUQ5ES6AP4" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.worker_role will be created
  + resource "aws_iam_role" "worker_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rs-worker-role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-06-25"
          + "ManagedBy" = "Terraform"
          + "Task"      = "3. K8s Cluster Configuration and Creation"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ssm_attach must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ssm_attach" {
      ~ id         = "rs-bastion-ssm-role-dev-20250625234539176300000002" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::767398122881:policy/rs-ssm-cert-read-policy-dev" -> (known after apply) # forces replacement
      ~ role       = "rs-bastion-ssm-role-dev" -> "rs-bastion-role-dev" # forces replacement
    }

  # aws_iam_role_policy_attachment.ssm_controlplane_attach will be created
  + resource "aws_iam_role_policy_attachment" "ssm_controlplane_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "rs-controlplane-role-dev"
    }

  # aws_iam_role_policy_attachment.ssm_worker_attach will be created
  + resource "aws_iam_role_policy_attachment" "ssm_worker_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "rs-worker-role-dev"
    }

  # aws_instance.k3s_control_plane will be updated in-place
  ~ resource "aws_instance" "k3s_control_plane" {
      ~ iam_instance_profile                 = "rs-bastion-instance-profile-dev" -> "rs-controlplane-instance-profile-dev"
        id                                   = "i-004bc6c836bf6cd48"
        tags                                 = {
            "Name" = "rs-k3s-control-plane-dev"
        }
        # (38 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.k3s_worker will be updated in-place
  ~ resource "aws_instance" "k3s_worker" {
      ~ iam_instance_profile                 = "rs-bastion-instance-profile-dev" -> "rs-worker-instance-profile-dev"
        id                                   = "i-0ae8202bdb4aa1c7b"
        tags                                 = {
            "Name" = "rs-k3s-worker-dev"
        }
        # (38 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # local_file.ssh_key will be created
  + resource "local_file" "ssh_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./blackbird.pem"
      + id                   = (known after apply)
    }

  # null_resource.provision_k3s_control_plane is tainted, so must be replaced
-/+ resource "null_resource" "provision_k3s_control_plane" {
      ~ id = "7326862244600897326" -> (known after apply)
    }

  # null_resource.provision_k3s_worker will be created
  + resource "null_resource" "provision_k3s_worker" {
      + id = (known after apply)
    }

Plan: 14 to add, 3 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "output.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @isbelevtsov, Action: `pull_request`, Working Directory: `task_3/project`, Workflow: `Terraform Plan and Apply`*